Autodesk.Revit.Exceptions.InvalidObjectException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.InvalidObjectException
The exception that is thrown when referencing an object that is no longer valid.
Remarks: The object may no longer exist for many reasons:
The object was explicitly deleted from the database. A change to other database items caused the item to be automatically deleted from the database. The object no longer exists as its creation was undone (by rolling a transaction back).